import { diffTime } from '../diffTime';


test('日期间隔时间', () => {
    expect(diffTime('2020-10-15', '2020-10-26')).toBe("11天")
})

test('日期间隔时间', () => {
    expect(diffTime('2020-10-15', '2020-10-25 12:03')).toBe("10天12小时3分");
})


test('日期间隔时间', () => {
    expect(diffTime('2020-10-15', '2020-10-26 12:00')).toBe("11天12小时")
})

test('日期间隔时间', () => {
    expect(diffTime('2020-10-15', '2020-10-26 12:22:33')).toBe("11天12小时22分")
})
test('日期间隔时间', () => {
    expect(diffTime('2020-10-26 10:10:11', '2020-10-26 12:22:33', true)).toEqual([0, 2, 12])
})
test('日期间隔时间', () => {
    expect(diffTime('2020-10-26 10:10:11', '2020-10-26 12:22:33')).toBe("2小时12分")
})
test('日期间隔时间', () => {
    expect(diffTime('2020-10-26', '2020-10-29 12:22:33', true)).toEqual([3, 12, 22])
})